Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::DuctTransitionPreferenceTable Class Referencefinal
MEP Element Manager
The DuctTransitionPreferenceTable contains cross section and geometry related information for Duct transitions. More...
#include <MEPDuctTransitionPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::DuctTransitionPreferenceTable:
 Classes
struct  | Key
The key that uniquely identifies a row in the DuctTransitionPreferenceTable. More...
class  | Modifier
Modifier of the DuctTransitionPreferenceTable. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetBeginReferenceId (uint32_t index) const
Result< uint32_t >  | GetEndReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Result< bool >  | IsRowValidByKey (const Key &key) const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Result< double >  | GetBeginDiameter (uint32_t index) const
Result< double >  | GetBeginDiameterByKey (const Key &key) const
Result< double >  | GetEndDiameter (uint32_t index) const
Result< double >  | GetEndDiameterByKey (const Key &key) const
Result< double >  | GetAngle (uint32_t index) const
Result< double >  | GetAngleByKey (const Key &key) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByKey (const Key &key) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< DuctTransitionPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a DuctTransitionPreferenceTable.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctTransitionPreferenceTable contains cross section and geometry related information for Duct transitions.
Since
Archicad 29
The table uses the keys defined by the DuctReferenceSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& ductTransitionTableId : ductTransitionTableIds) {
 ACAPI::Result<DuctTransitionPreferenceTable> ductTransitionTable = DuctTransitionPreferenceTable::Get (ductTransitionTableId);
 if (ductTransitionTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", ductTransitionTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < ductTransitionTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Begin ReferenceId", *ductTransitionTable->GetBeginReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("End ReferenceId", *ductTransitionTable->GetEndReferenceId (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Begin Diameter", *ductTransitionTable->GetBeginDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("End Diameter", *ductTransitionTable->GetEndDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Angle", *ductTransitionTable->GetAngle (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductTransitionTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*ductTransitionTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification
 ACAPI::Result<DuctTransitionPreferenceTable> newTable = DuctTransitionPreferenceTable::Get (*newTableId);
 if (newTable.IsErr ())
 return newTable.UnwrapErr ().kind;
 ACAPI::Result<DuctReferenceSet> referenceSet = GetDuctReferenceSet ();
 if (referenceSet.IsErr ())
 return referenceSet.UnwrapErr ().kind;
 newTable->Modify ([&] (DuctTransitionPreferenceTable::Modifier& modifier) -> GSErrCode {
 for (uint32_t i = 1; i < referenceSet->GetSize (); ++i) {
 ACAPI::Result<uint32_t> prevReferenceId = referenceSet->GetReferenceId (i - 1);
 ACAPI::Result<uint32_t> referenceId = referenceSet->GetReferenceId (i);
 ACAPI::Result<uint32_t> newRowIndex = modifier.AddNewRow ({ *referenceId, *prevReferenceId });
 if (newRowIndex.IsErr ())
 continue;
 modifier.SetBeginDiameter (*newRowIndex, static_cast<double> (*referenceId) / 1000.0);
 modifier.SetEndDiameter (*newRowIndex, static_cast<double> (*prevReferenceId) / 1000.0);
 modifier.SetAngle (*newRowIndex, 60.0);
 }
 return NoError;
 }, "Fill the new table with values");
 preferenceReporter.Add ("Delete the first row of the new Duct Transition table.");
 newTable->Modify ([&] (DuctTransitionPreferenceTable::Modifier& modifier) {
 ACAPI::Result<void> deleteRowResult = modifier.DeleteRow (0);
 if (deleteRowResult.IsOk ())
 preferenceReporter.Add ("Delete row was successful.");
 else
 preferenceReporter.Add ("Delete row unsuccessful", GS::UniString (deleteRowResult.UnwrapErr ().text));
 }, "Delete Row from preference table.");
 preferenceReporter.Add ("Modify row identified by ReferenceIds.");
 newTable->Modify ([&] (DuctTransitionPreferenceTable::Modifier& modifier) {
 ACAPI::Result<uint32_t> beginReferenceId = newTable->GetBeginReferenceId (1);
 ACAPI::Result<uint32_t> endReferenceId = newTable->GetEndReferenceId (1);
 const DuctTransitionPreferenceTable::Key key = { *beginReferenceId, *endReferenceId };
 ACAPI::Result<double> currentAngle = newTable->GetAngleByKey (key);
 modifier.SetAngleByKey (key, *currentAngle / 2.0);
 modifier.SetDescriptionByKey (key, "Halved!");
 }, "Modify row identified by ReferenceIds.");
 preferenceReporter.Write ();
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::DuctTransitionPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< DuctTransitionPreferenceTable > ACAPI::MEP::DuctTransitionPreferenceTable::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a DuctTransitionPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested DuctTransitionPreferenceTable.
Returns
If the uniqueId belongs to a DuctTransitionPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetAngle()
 Result< double > ACAPI::MEP::DuctTransitionPreferenceTable::GetAngle  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the angle value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetAngleByKey()
 Result< double > ACAPI::MEP::DuctTransitionPreferenceTable::GetAngleByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the angle value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginDiameter()
 Result< double > ACAPI::MEP::DuctTransitionPreferenceTable::GetBeginDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the begin diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginDiameterByKey()
 Result< double > ACAPI::MEP::DuctTransitionPreferenceTable::GetBeginDiameterByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the begin diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginReferenceId()
 Result< uint32_t > ACAPI::MEP::DuctTransitionPreferenceTable::GetBeginReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the begin referenceId of the table's row.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::DuctTransitionPreferenceTable::GetDescription  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByKey()
 Result< GS::UniString > ACAPI::MEP::DuctTransitionPreferenceTable::GetDescriptionByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the description of the table's row.
◆ GetEndDiameter()
 Result< double > ACAPI::MEP::DuctTransitionPreferenceTable::GetEndDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the end diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetEndDiameterByKey()
 Result< double > ACAPI::MEP::DuctTransitionPreferenceTable::GetEndDiameterByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the end diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetEndReferenceId()
 Result< uint32_t > ACAPI::MEP::DuctTransitionPreferenceTable::GetEndReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the end referenceId of the table's row.
◆ GetName()
 GS::UniString ACAPI::MEP::DuctTransitionPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 uint32_t ACAPI::MEP::DuctTransitionPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::DuctTransitionPreferenceTable::IsRowValid  |  ( |  uint32_t |  index | ) |   const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByKey()
 Result< bool > ACAPI::MEP::DuctTransitionPreferenceTable::IsRowValidByKey  |  ( |  const Key & |  key | ) |   const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the validity state of the row.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.